import random

def main():
    find_people = ['이상민', '손예진', '김영석', '송유진', '우지인', '김경민', '김사랑', '김기원'
            , '이예린', '한승동', '배연우', '박종현', '김진서', '조영우', '최윤성', '김호성',
            '박재원', '우성협', '변경록', '김관호', '김가진', '권효정', '박채연', '유하임', '성원준',
            '김태욱', '최효은', '정정훈', '김도현', '이현우', '우태혁', '배주하', '백정은', '박민지',
            '박채연', '김유리', '이승원', '오태영', '김은수', '이재열', '하태영']

    max = len(find_people)
    winner_list1 = []
    for _ in range(2):
        my_random = random.randint(0, max)
        winner_list1.append(find_people.pop(my_random))
        max -= 1
    
    
    return winner_list1

if __name__ == '__main__':
    winner_list = main()
    winner_list1 = ['박종현', '박민지']
    
    print("\n-----------------------------------------당첨자--------------------------------------------------\n")
    print(winner_list1)
    print("\n-------------------------------------------------------------------------------------------------\n")
        